//SORTJOB JOB MSGLEVEL=1,CLASS=A,MSGCLASS=A,TIME=1,NOTIFY=&SYSUID
//MYSORT EXEC PGM=SORT
//SORTIN DD DISP=SHR,DSN=CUST.FILE
//SORTOUT DD SYSOUT=*














