       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOP_SUBROUTINE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COUNTER PIC 9(1) VALUE 0.
       PROCEDURE DIVISION.
       100-PARAGRAPH-LOOP.
           PERFORM 200-PRINT-COUNTER 5 TIMES.
       GOBACK.
       200-PRINT-COUNTER.
           ADD 1 TO COUNTER
           DISPLAY "Loop number " COUNTER.
