       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRINTNAME.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
         WORKING-STORAGE SECTION.
           01 USER-NAME PIC X(15).
       PROCEDURE DIVISION.
       100-GET-USER-INPUT.
           DISPLAY "Enter the user name"
           ACCEPT USER-NAME.
       200-PRINT-USER-NAME.
           DISPLAY "The user name is " USER-NAME.
       300-PRINT-PROGRAM-END.
       GOBACK.
