       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOP_SUBROUTINE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COUNTER PIC 9(1) VALUE 0.
       PROCEDURE DIVISION.
       PERFORM UNTIL COUNTER >= 5
           ADD 1 TO COUNTER
	          DISPLAY "Loop number " COUNTER
       END-PERFORM
       GOBACK.
