       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUST-FILE-ERROR.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT CUSTOMER-FILE ASSIGN TO
           " Customers.dat"
           FILE STATUS IS FILE-EXISTS
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD  CUSTOMER-FILE.
       01  CUSTOMER-RECORD.
           05 FIRST-NAME  PIC X(20).
           05	LAST-NAME   PIC X(20).
       WORKING-STORAGE SECTION.
       01 WS-CUSTOMER-RECORD.
           05 WS-FIRST-NAME  PIC X(20).
           05 WS-LAST-NAME   PIC X(20).
           05 FILE-EXISTS    PIC X(2).
       01 WS-EOF             PIC X.
       PROCEDURE DIVISION.
       OPEN INPUT CUSTOMER-FILE.
       IF FILE-EXISTS NOT = "00"
            DISPLAY "File does not exist"
            PERFORM 200-END-PROGRAM
       END-IF.
       PERFORM UNTIL WS-EOF = 'Y'
           READ CUSTOMER-FILE INTO WS-CUSTOMER-RECORD
           AT END MOVE 'Y' TO WS-EOF
           NOT AT END DISPLAY WS-CUSTOMER-RECORD
       END-READ
       END-PERFORM.
       CLOSE CUSTOMER-FILE.
       200-END-PROGRAM.
       GOBACK.
