       IDENTIFICATION DIVISION.
       PROGRAM-ID. INVENTORYRPT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INVENTORY-FILE ASSIGN TO
           "INVENTORY-FILE.DAT"
           FILE STATUS IS FILE-EXISTS
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT TRANS-FILE ASSIGN TO
           "INVENTORY-TRANS.DAT"
           FILE STATUS IS FILE-EXISTS2
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT NEW-INVENTORY-FILE ASSIGN TO
           "NEW-INVENTORY-FILE.DAT"
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT ERROR-FILE ASSIGN TO
           "ERRORREPORT.DAT"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INVENTORY-FILE.
       01 INVENTORY-RECORD.
       88 END-OF-FILE VALUE HIGH-VALUES.
           05 SKU PIC X(3).
           05 ITEM-NAME PIC X(20).
           05 QUANTITY PIC 9(3).
       FD TRANS-FILE.
       01 TRANS-RECORD.
       88 END-OF-FILE-TRANS VALUE HIGH-VALUES.
           05 TRANS-SKU PIC X(3).
           05 TRANS-DATE PIC X(8).
           05 TRANS-QUANTITY PIC 9(3).
       FD NEW-INVENTORY-FILE.
       01 NEW-INVENTORY-RECORD.
           05 NEW-SKU PIC X(3).
           05 NEW-ITEM-NAME PIC X(20).
           05 NEW-QUANTITY PIC 9(3).
       FD ERROR-FILE.
       01 PRINTLINE.
           05 FILLER PIC X(28).
       WORKING-STORAGE SECTION.
       01 WS-DETAILS.
           05 FILE-EXISTS PIC X(2).
           05 FILE-EXISTS2 PIC X(2).
       PROCEDURE DIVISION.
       0100-INVENTORY-PROCESSING.
       OPEN INPUT INVENTORY-FILE
       IF FILE-EXISTS NOT = "00"
           DISPLAY "Error in opening the inventory master file "
           PERFORM 9000-END-PROGRAM
       END-IF.
       OPEN INPUT TRANS-FILE
       IF FILE-EXISTS2 NOT = "00"
           DISPLAY "Error in opening the inventory transation file "
           PERFORM 9000-END-PROGRAM
       END-IF.
       OPEN OUTPUT NEW-INVENTORY-FILE.
       OPEN OUTPUT ERROR-FILE.
       PERFORM 0300-READ-INVENTORY-FILE
       PERFORM 0400-READ-TRANSACTION-FILE
       PERFORM 0200-MATCH-INVENTORY UNTIL
           END-OF-FILE AND END-OF-FILE-TRANS.
       PERFORM 9000-END-PROGRAM.
       0200-MATCH-INVENTORY.
       EVALUATE TRUE
       WHEN SKU = TRANS-SKU
           PERFORM 0500-UPDATE-FILE
       WHEN SKU < TRANS-SKU
           PERFORM 0600-NO-UPDATE
       WHEN OTHER
           PERFORM 0700-CREATE-ERROR-RECORD
       END-EVALUATE.
       0300-READ-INVENTORY-FILE.
       READ INVENTORY-FILE
           AT END SET END-OF-FILE TO TRUE
       END-READ.
       0400-READ-TRANSACTION-FILE.
       READ TRANS-FILE
           AT END SET END-OF-FILE-TRANS TO TRUE
       END-READ.
       0500-UPDATE-FILE.
           MOVE INVENTORY-RECORD TO NEW-INVENTORY-RECORD
           COMPUTE NEW-QUANTITY = NEW-QUANTITY + TRANS-QUANTITY
           WRITE NEW-INVENTORY-RECORD
           PERFORM 0300-READ-INVENTORY-FILE
           PERFORM 0400-READ-TRANSACTION-FILE.
       0600-NO-UPDATE.
           WRITE NEW-INVENTORY-RECORD FROM INVENTORY-RECORD
           PERFORM 0300-READ-INVENTORY-FILE.
       0700-CREATE-ERROR-RECORD.
           MOVE TRANS-SKU TO NEW-SKU
           WRITE PRINTLINE FROM TRANS-RECORD
           PERFORM 0400-READ-TRANSACTION-FILE.
       9000-END-PROGRAM.
           CLOSE INVENTORY-FILE.
           CLOSE TRANS-FILE.
           CLOSE ERROR-FILE.
           CLOSE NEW-INVENTORY-FILE.
       GOBACK.
