       IDENTIFICATION DIVISION.
       PROGRAM-ID. NAME-LIST.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT NAME-FILE
           ASSIGN TO "Names.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD NAME-FILE
           RECORD IS VARYING IN SIZE
           DEPENDING ON NAME-LENGTH.
       01 NAME-RECORD PIC X(40).
       88 END-OF-FILE VALUE HIGH-VALUES.
       WORKING-STORAGE SECTION.
       01 NAME-LENGTH PIC 99.
       PROCEDURE DIVISION.
       OPEN INPUT NAME-FILE
       READ NAME-FILE
           AT END SET END-OF-FILE TO TRUE
       END-READ
       PERFORM UNTIL END-OF-FILE
           DISPLAY NAME-RECORD(1:NAME-LENGTH)
           READ NAME-FILE
              AT END SET END-OF-FILE TO TRUE
           END-READ
       END-PERFORM
       CLOSE NAME-FILE
       GOBACK.
