       IDENTIFICATION DIVISION.
       PROGRAM-ID. SALESRPT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SALES-FILE ASSIGN TO
           "Sales.Dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD SALES-FILE.
       01 SALES-REP.
       88 END-OF-FILE VALUE HIGH-VALUES.
           05 TYPE-CODE PIC X.
       88 SALES-REP-CODE VALUE "R".
       88 RECEIPT-CODE VALUE "S".
           05 SALESPERSON-NAME PIC X(20).
       01 SALES-RECIPT.
           05 TYPE-CODE PIC X.
           05 RECEIPT PIC 9(3).
       WORKING-STORAGE SECTION.
       01 CURRENCY-FORMAT PIC $$,$$$.
       01 SALES-TOTAL PIC 9(5).
       PROCEDURE DIVISION.
       100-MAIN.
           OPEN INPUT SALES-FILE
           PERFORM 400-READ-FILE.
           PERFORM 200-SALES-REPORT
              UNTIL END-OF-FILE
       CLOSE SALES-FILE
       GOBACK.
       200-SALES-REPORT.
           DISPLAY SALESPERSON-NAME
           MOVE ZEROS TO SALES-TOTAL
           PERFORM 400-READ-FILE.
           PERFORM 300-CALC-SALES
              UNTIL SALES-REP-CODE OR END-OF-FILE
           MOVE SALES-TOTAL TO CURRENCY-FORMAT
           DISPLAY CURRENCY-FORMAT.
       300-CALC-SALES.
           COMPUTE SALES-TOTAL = SALES-TOTAL + RECEIPT
           PERFORM 400-READ-FILE.
       400-READ-FILE.
           READ SALES-FILE
             AT END SET END-OF-FILE TO TRUE
           END-READ.
