       IDENTIFICATION DIVISION.
       PROGRAM-ID. DELIMITER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIRST-NAME PIC X(15) VALUE "Jane".
       01 LAST-NAME PIC X(15) VALUE "Murphy".
       01 FULL-NAME PIC X(30).
       PROCEDURE DIVISION.
       STRING FIRST-NAME DELIMITED BY SPACE " " DELIMITED BY SIZE
       LAST-NAME DELIMITED BY SPACE INTO FULL-NAME
       DISPLAY FULL-NAME
       GOBACK.
