       IDENTIFICATION DIVISION.
       PROGRAM-ID. INVENTORY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT INVENTORY-FILE ASSIGN TO
           "c:\users\ttaul\onedrive\desktop\Inventory.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD INVENTORY-FILE.
       01 INVENTORY-RECORD.
       88 END-OF-FILE VALUE HIGH-VALUES.
           05 SKU PIC 99.
           05 PRODUCT-DESCRIPTION PIC X(20).
           05 QUANTITY PIC 9(3) OCCURS 4 TIMES.
       WORKING-STORAGE SECTION.
       01 INVENTORY-TABLE.
           05 IT-RECORD OCCURS 3 TIMES INDEXED BY IT-INDEXED.
              10 IT-SKU PIC 99.
              10 IT-PRODUCT-DESCRIPTION PIC X(20).
              10 IT-QUANTITY PIC 9(3) OCCURS 4 TIMES.
       01 REPORT-HEADING.
           05 FILLER PIC X(10) VALUE SPACES.
           05 FILLER PIC X(40) VALUE "Inventory Search".
       01 REPORT-LINE.
           05 FILLER PIC X(50) VALUE ALL "-".
       01 SKU-INDEX PIC 99.
       01 REGION-INDEX PIC 99.
       01 SEARCH-KEY PIC 9(3).
       01 SEARCH-FEEDBACK PIC X(20).
       PROCEDURE DIVISION.
       100-START-PROGRAM.
           MOVE ZEROS TO INVENTORY-TABLE
           OPEN INPUT INVENTORY-FILE
           READ INVENTORY-FILE
           AT END SET END-OF-FILE TO TRUE
       END-READ
       COMPUTE SKU-INDEX = 1
       PERFORM UNTIL END-OF-FILE
           ADD SKU TO IT-SKU(SKU-INDEX)
           MOVE PRODUCT-DESCRIPTION TO
           IT-PRODUCT-DESCRIPTION(SKU-INDEX)
       PERFORM VARYING REGION-INDEX FROM 1 BY 1
           UNTIL REGION-INDEX > 4       
       ADD QUANTITY(REGION-INDEX) TO
       IT-QUANTITY(SKU, REGION-INDEX)
       END-PERFORM
       COMPUTE SKU-INDEX = SKU-INDEX + 1
       READ INVENTORY-FILE
           AT END SET END-OF-FILE TO TRUE
       END-READ
       END-PERFORM
       DISPLAY REPORT-HEADING
       DISPLAY REPORT-LINE
       DISPLAY "Enter your search: "
           ACCEPT SEARCH-KEY
           SEARCH IT-RECORD
           AT END
           MOVE 'Not found' TO SEARCH-FEEDBACK
           WHEN IT-SKU (IT-INDEXED) = SEARCH-KEY
           MOVE IT-PRODUCT-DESCRIPTION(IT-INDEXED)
           TO SEARCH-FEEDBACK
       END-SEARCH.
       DISPLAY REPORT-LINE
       DISPLAY "Inventory information for: " SEARCH-FEEDBACK
       PERFORM VARYING REGION-INDEX FROM 1 BY 1
           UNTIL REGION-INDEX > 4
           DISPLAY "Region Number " REGION-INDEX " quantity: "
       IT-QUANTITY (IT-INDEXED REGION-INDEX)
       END-PERFORM
       CLOSE INVENTORY-FILE
       GOBACK.
