       IDENTIFICATION DIVISION.
       PROGRAM-ID. REFMOD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TODAY-DATE PIC X(10) VALUE '01/01/2021'.
       01 TODAY-DATE-PART PIC X(10).
       PROCEDURE DIVISION.
       MOVE TODAY-DATE (4:2) TO TODAY-DATE-PART
       DISPLAY TODAY-DATE-PART
       GOBACK.
