       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FULL-NAME PIC X(30).
       PROCEDURE DIVISION.
       STRING "Jane" " " "Murphy" DELIMITED BY SIZE Into FULL-NAME
       DISPLAY FULL-NAME
       GOBACK.
