       IDENTIFICATION DIVISION.
       PROGRAM-ID. UNSTRING2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NAME-1 PIC X(15).
       01 NAME-2 PIC X(15).
       01 NAME-3 PIC X(15).
       01 NAME-4 PIC X(15).
       01 FULL-NAME PIC X(30) VALUE "Grace Brewster Murray Hopper".
       PROCEDURE DIVISION.
       UNSTRING FULL-NAME DELIMITED BY SPACE INTO NAME-1 NAME-2 NAME-3
       NAME-4
       DISPLAY NAME-1
       DISPLAY NAME-2
       DISPLAY NAME-3
       DISPLAY NAME-4
       GOBACK.
