       IDENTIFICATION DIVISION.
       PROGRAM-ID. UNSTRING3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIRST-NAME PIC X(15).
       01 LAST-NAME PIC X(15).
       01 FULL-NAME PIC X(30) VALUE "Grace Hopper".
       01 FIRST-NAME-COUNTER PIC 9.
       01 LAST-NAME-COUNTER PIC 9.
       PROCEDURE DIVISION.
       UNSTRING FULL-NAME DELIMITED BY SPACE INTO
       FIRST-NAME COUNT IN FIRST-NAME-COUNTER
       LAST-NAME COUNT IN LAST-NAME-COUNTER
       DISPLAY FIRST-NAME
       DISPLAY "Length: " FIRST-NAME-COUNTER
       DISPLAY LAST-NAME
       DISPLAY "Length: " LAST-NAME-COUNTER
       GOBACK.
