       IDENTIFICATION DIVISION.
       PROGRAM-ID. UNSTRING1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIRST-NAME PIC X(15).
       01 LAST-NAME PIC X(15).
       01 FULL-NAME PIC X(30) VALUE "Grace Hopper".
       PROCEDURE DIVISION.
       UNSTRING FULL-NAME DELIMITED BY SPACE INTO FIRST-NAME LAST-NAME
       DISPLAY FIRST-NAME
       DISPLAY LAST-NAME
       GOBACK.
